# TAPS
tap "exolnet/deprecated"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "shivammathur/php"
tap "shivammathur/extensions"

# BREWS
brew "adr-tools"
brew "awscli"
brew "bash"
brew "bat"
brew "python"
brew "composer"
brew "coreutils"
brew "curl"
brew "deno"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "firebase-cli"
brew "geckodriver"
brew "git"
brew "go"
brew "htop"
brew "httpie"
brew "jq"
brew "mas"
brew "most"
brew "ncdu"
brew "neovim"
brew "ngrep"
brew "nss"
brew "pkg-config"
brew "prettyping"
brew "pv"
brew "rsync"
brew "ruby"
brew "speedtest-cli"
brew "ssh-copy-id"
brew "tldr"
brew "tree"
brew "wget"
brew "yarn"

# PHP with Extensions
brew "shivammathur/php/php@7.4"
brew "shivammathur/extensions/amqp@7.4"
brew "shivammathur/extensions/apcu@7.4"
brew "shivammathur/extensions/imap@7.4"
brew "shivammathur/php/php@8.0"
brew "shivammathur/extensions/amqp@8.0"
brew "shivammathur/extensions/apcu@8.0"
brew "shivammathur/extensions/imap@8.0"
brew "shivammathur/php/php@8.1"
brew "shivammathur/extensions/amqp@8.1"
brew "shivammathur/extensions/apcu@8.1"
brew "shivammathur/extensions/imap@8.1"

# CASKS
cask "1password"
cask "adobe-creative-cloud"
cask "balenaetcher"
cask "charles"
cask "chromedriver"
cask "cocoarestclient"
cask "discord"
cask "docker"
cask "evernote"
cask "firefox-developer-edition"
cask "focusrite-control"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "geekbench"
cask "google-chrome"
cask "iterm2"
cask "keka"
cask "kodi"
cask "logitech-options"
cask "macdown"
cask "ngrok"
cask "paw"
cask "phpstorm"
cask "postman"
cask "resilio-sync"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "quicknfo"
cask "setapp"
cask "sf-symbols"
cask "slack"
cask "soundsource"
cask "suspicious-package"
cask "tripmode"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "webpquicklook"
cask "zoom"

# MASES
mas "Amphetamine", id: 937984704
mas "Blackmagic RAW Speed Test", id: 1466185689
mas "Disk Speed Test", id: 425264550
mas "Sequel Ace", id: 1518036000
mas "Evernote", id: 406056744
mas "NotePlan3", id: 1505432629
